[
{"text": "Olá pessoal, esta é a parte III da série sobre o Scrapy, abaixo os links para todos os artigos da série:\nNos artigos anteriores mostrei como capturar os dados imobiliários do site OLX usando o scrapy e depois como armazenar em um banco de dados, no caso em questão usamos o \n.\nAgora iremos ver como colocar o nosso projeto Scrapy para rodar em um servidor na nuvem, pois quando você está fazendo um crawler um pouco maior que leva mais tempo para capturar as informações fica inviável deixar ele rodando na sua máquina já que você pode querer desligá-la, reiniciá-la ou pode simplesmente deixar em espera o que iria interromper o processamento.\nExistem algumas formas de se colocar um projeto scrapy em um \n, vou listar algumas:\nCrontab\nSupervisor\nScrapyd\nScrapinghub\nPor hora eu irei fazer apenas uma pequena apresentação de todas essas opções expandindo apenas a Scrapyd, futuramente irei gravar um vídeo mostrando como utilizar as opções do crontab e supervisor.\nO \n é um utilitário de sistemas Unix que gerencia comandos que precisam ser executados com alguma periodicidade, assim basta acessar um VPS via ssh, baixar o seu código, instalar as dependências - realizar os passos iniciais presentes nos artigos anteriores - e depois adicionar a tarefa de acordo com o padrão que o crontab aceita (veja o link do \n).\nO \n é um sistema desenvolvido em Python que controla a execução de processos. Eu utilizo ele bastante em meus projetos, pois com ele eu tenho como organizar a execução de processos indicando o usuário que irá executar, o diretório de acesso, controle de log e via linha de comando posso iniciar ou terminar o processo de maneira bem simples.\n é a empresa por trás do Scrapy, e essa plataforma dá a possibilidade de você fazer o deploy facilitado de seus crawlers que utilizam o Scrapy, além de visualizar as estatísticas e os dados gerados pelos crawlers.\nO \n é uma aplicação que fornece uma API REST em que você pode fazer upload de seus projetos além de iniciar ou parar a execução de crawlers presentes no seu projeto.\nPara utilizar o Scrapyd eu recomendo acessar a sua máquina VPS e em seguida baixar e instalar o Scrapyd.\nConsiderando que já está no terminal do seu VPS, faça:\nObs1: você pode criar um virtualenv ou se preferir instalar globalmente verifique se está acessando com o usuário \n ou no grupo \n.\nObs2: linhas com o caractere \"$\" são comandos executados, linhas sem esse caractere é a saída esperada.\nApós a instalação do scrapyd, um novo comando estará disponível:\nAo rodar este comando você verá que ele irá ativar um servidor web na porta 6800, entretanto você não vai querer rodar o servidor dessa forma, você irá precisar colocar ele em modo daemon para que possa realizar outras atividades e deixá-lo rodando. Como estou acostumado com o supervisor, utilizei ele para monitorar e iniciar o processo do scrapyd - nesse caso ele não vai rodar o crawler em específico, vai rodar o scrapyd e este vai ser responsável pela execução dos crawlers.\nPara esse experimento estou utilizando uma máquina com Ubuntu, assim posso instalar o Supervisor dessa forma:\nCaso utilize outra distribuição Linux procure os pacotes relacionados ao Supervisor ou instale via pip:\nhttp://supervisord.org/installing.html#installing-via-pip\nQuando instalado via gerenciador de pacotes da distribuição ele já é executado assim que iniciar a máquina, assim basta criar um arquivo de configuração para o processo relativo ao Scrapyd:\nEm seguida coloque o seguinte conteúdo no arquivo \n:\nNão é recomendado utilizar o usuário root mas para fins de teste irei indicar este usuário, mas lembre-se de criar um usuário para o scrapyd quando for colocar em produção.\nA parte \n indica o nome do programa, vai ser útil na hora de iniciar ou para o processo, o \n é o comando que irá ser executado, caso esteja utilizando um virtualenv será preciso indicar o caminho do script \n relativo ao virtualenv. O \n indica que usuário irá rodar o comando e a opção \n serve para reiniciar o processo sempre que ele \"cair\", independente do que aconteceu, mais detalhes em:\nhttp://supervisord.org/configuration.html\nAgora para ativar o scrapyd iremos executar o comando:\nAgora já podemos acessar a interface web fornecida pelo scrapyd, basta ir no navegador e digitar:\nhttp://<IP-DO-VPS>:6800/\nSe tudo deu certo, você verá uma interface extremamente simples, agora saia do VPS e volte a trabalhar localmente.\nAcessando a basta do projeto localmente - com o virtualenv ativado caso esteja utilizando, instale:\nCom esse pacote iremos ter um facilitador para o deploy do nosso projeto no servidor onde está o scrapyd, pois o scrapyd fornece uma API REST para fazer upload do nosso projeto no formato \n. O scrapyd-client fornece um comando \n que facilita essa geração do egg e em seguida upload para o servidor, assim no arquivo \n do seu projeto adicione no final (ou substitua caso já tenha algum valor para a configuração \n):\nEm seguida faça o deploy do seu projeto:\nObs: No exemplo da série o nome do projeto é \n.\nAgora você já pode colocar um crawler para rodar, para isso é preciso acessar a API REST do Scrapyd:\nEu utilizei o \n, mas você poderia utilizar qualquer ferramenta que possa fazer um GET ou POST dependendo do que deseja fazer, todas as opções da API do Scrapyd, você pode ver em:\nhttp://scrapyd.readthedocs.org/en/latest/api.html\nFinalmente podemos ver se o nosso crawler está rodando corretamente acessando a interface web do scrapyd que visualiza os \n:\nhttp://<IP-DO-VPS>:6800/jobs\nEu gosto bastante da simplicidade do Scrapyd, entretanto ele não oferece muitas possibilidades para uma melhor visualização dos itens coletados e a interface web se restringe a visualizar, não é possível adicionar spiders e projetos. Além disso, ele deixa \"público\" o acesso aos jobs e itens - uma forma de burlar isso seria fazendo um proxy com o nginx ou apache e colocando uma autenticação como o \n.\nEsta série acaba por aqui mas em breve irei falar mais sobre esses dados coletados mas o foco não será mais o scrapy, será a análise desses dados.", "category": "tutoriais"},
{"text": "Obs: No final do texto tem alguns links e palestras interessantes mas vou contextualizar minha história antes.\nNos últimos 2 anos eu tenho estudado bastante coisas relacionadas a Lifestyle Business, e isso começou quando eu percebi que o buraco negro corporativo e nem o conto de fadas das startups eram o que eu queria.\nFiquei em conflito por um bom tempo até que lancei a ideia de uma palestra chamada \"Morte as Startups, vamos inovar de verdade\" na PythonBrasil 10 (no final têm os slides).\nA partir dai comecei a procurar um termo que demonstrasse o que eu já estava começando a viver e que me ajudasse a encontrar pessoas que compartilhavam minhas ideias, assim poderia seguir esse novo caminho com mais segurança e motivação. Dai surgiu o Lifestyle Business citado pelo Henrique Bastos que eu já tinha visto na palestra da primeira Python Nordeste realizada em Fortaleza/CE, fiz a associação e vi que era isso que eu buscava.\nEu gostava/gosto de programar, curtia/curto pegar projetos interessantes, se tiver algo ligado a análise de dados e inteligência artificial melhor ainda, mas eu não queria ser aquele cara que o Vida de Programador fica zuando (só zuando?)[2]. Não concordava com uma vida em que eu tenha que vender minhas horas, afinal tempo é a única coisa que não se compra (exceto quando houver uma máquina do tempo), o Larusso fez uma boa provocação[3]. Eu posso querer trabalhar para alguma empresa mas não será pelo simples fato de receber um valor baseado nas horas de trabalho, tem que ter algo a mais ai. E foi assim que comecei a mudar minha vida, e a primeira coisa que eu fiz foi dizer NÃO:\nNão a diversos projetos que não eram interessantes (só $ não conta);\nNão a \"nova maior startup promissora do momento\";\nNão a propostas de emprego em que eu seria escravo das 9 às 18 e quando eu tivesse meus 50+ anos iria curtir algo;\nNão a ficar programando de madrugada em coisas sem sentido: ninguém é produtivo tantas horas seguidas, se você acha que é, reflita o que essas horas mudou de fato o que você é hoje e me fale pelos comentários.\nO simples fato de decidir o que realmente quero e fazer algumas decisões dificeis, fez com que eu tivesse mais tempo para projetos pessoais, universidade e, principalmente, família.\nTem algumas pessoas que falam melhor sobre isso do que eu, assim vou colocar alguns links interessantes e o primeiro é do Henrique Bastos que está com uma séria de vídeos maneiros sobre programação e felicidade e tem tudo haver com o que falei acima.\nAbaixo segue uma playlist com vídeos do Henrique sobre o assunto:\nAgora segue os slides da minha palestra na PythonBrasil 10 e depois os slides reformulados e melhorados para a Semana da Computação da UFRPE:", "category": "utils"},
{"text": "Olá pessoal, a algum tempo eu fechei as inscrições do meu curso de Django com Python 3 que comecei em 2014. Neste curso foi desenvolvido um projeto chamado SimpleMOOC, uma simples plataforma para ensino a distância que tinha fins didáticos.\nRecentemente eu resolvi disponibilizar as vídeo-aulas desse curso pois irei construir um novo curso com algumas sugestões de alunos e de amigos, assim publiquei o curso na plataforma do Udemy, que é um lugar que pretendo colocar novos conteúdos, gratuitos e pagos.\nO curso foi gravado em 2014/2015 mas o conteúdo é bastante relevante e é uma ótima opção para quem está iniciando no mundo web com Python.\nLink do curso: \nPara saber mais novidades sobre meus cursos, inscreva-se abaixo:", "category": "cursos"},
{"text": "Uma das coisas mais interessantes do framework \n é sem dúvidas o seu \n. E o que o torna interessante é a sua simplicidade e objetividade quando se utiliza os \n para realizar consultas simples e até as complexas que envolvem join's.\nNeste artigo irei explorar algumas coisas básicas para quem está iniciando mas também irei mostrar casos de uso mais avançados como uso de funções próprias do banco de dados. Para demonstrar as consultas irei utilizar uma modelagem simples para uma aplicação de atividades realizadas, os modelos estão abaixo:\nDados de teste:\nPara acessar qualquer objeto salvo no banco de dados é preciso acessar primeiro o \n do \n, isto é, o atributo \n presente em todo \n. Esse \n tem diversos métodos que no final de contas vão chamar um objeto do tipo \n, este é que fica responsável pelas consultas de fato. Eu vou separar a explicação das consultas por partes:\nO principal método da \n é o \n, o \n tem um atalho para ele com o mesmo nome. Com esse método você irá realizar as consultas passando as condições da seguinte forma:\nOs dois underlines/underscores servem para indicar ao Django qual o nome do campo e qual o lookup será utilizado, pois o django vai receber esse parâmetro de forma dinâmica, também conhecido como parâmetros \n de uma função. Abaixo seguem alguns exemplos de uso com os modelos definidos anteriormente:\nCom o lookup \n eu posso filtrar campos de texto procurando por parte da palavra, no caso qualquer usuário que tenha a palavra \n no nome.\nO \n é apenas um dos lookups disponíveis, para ver todos os lookups possívels acesse: \nNo entanto é comum realizar consultas que verificam mais de um campo, para condições do tipo \n é possível utilizar o \n normalmente apenas indicando as condições com vírgula, isto é, passando vários parâmetros de uma vez ou realizando a consulta encadeada:\nPara consultas do tipo \n é necessário chamar o objeto \n, ele é o responsável por transcrever a consulta que será realizada. Quando utilizamos o \n ele é chamado de forma implicíta, para utilizar de forma explicíta basta passá-lo como parâmetro posicional no \n:\nA barra vertical entre as duas chamadas de \n serve para criar o \n entre as condições, isto funciona porque o objeto \n implementa o método mágico \n. Essa é a grande sacada das melhores libs e frameworks Python, utilizar-se dos métodos mágicos para sobreescrever operadores e açucares sintáticos previstos na definição de Python.\nÉ possível combinar \n e \n até que a consulta deseja seja gerada, para usar o \n basta utilizar o \n ao invés da barra vertical.\nAlguns lookups são específicos para determinados tipos de dados, como o \n que funciona com campos de data e verifica se uma determinada data está entre 2 datas especificadas:\nO objeto \n além de entender diversos lookups, ele também entende quando o atributo a ser utilizado na condição é uma \n e deseja-se aplicar a condição sobre um valor presente no objeto relacionado. Para isto utiliza-se novamente o dois underlines/underscores, assim ele irá realizar o join necessário para a consulta encadeada:\nEm todo relacionamento o Django cria o acesso inverso, isto é, se o model \n tem um atributo chamado \n que faz o relacionamento com a classe \n, o \n terá um atributo criado automaticamente com o padrão:\nAssim é possível acessar os objetos da classe \n através de uma instância de \n:\nEsse atributo é uma \n previamente filtrada e que pode ser aplicado outras condições como qualquer \n.\nAs consultas que envolvem relacionamentos também permitem realizar o fluxo inverso, isto é, filtrar a classe \n para depois consultar a classe \n. Isto é bastante útil quando você deseja obter objetos que tem algum tipo de pré-requisito relacionado aos seus \n:\nO objeto \n é um tipo especial de \n que armazena apenas o valor dos campos indicados na chamada do \n.\nComo o nome já diz, o \n irá agregar o resultado de uma consulta em apenas uma linha, normalmente apenas um valor. Na prática se utiliza quando deseja-se somar, verificar o máximo e mínimo, contar e outras operações semelhantes:\nO retorno do \n é um dicionário, e caso a chamada for com parâmetros não nomeados ele gera a chave para cada valor de acordo com o nome do atributo e o tipo do \n.\nJá o \n serve para adicionar informações no objeto que está sendo consultado, como no exemplo abaixo:\nIsso funciona porque o model \n sabe que tem um relacionamento com o model \n, você consegue ver isso de forma dinâmica acessando a meta informação sobre a classe:\nO \n é bastante poderoso, por exemplo se eu quisesse as últimas atividades cadastradas do usuário, isto é, as atividades com maior ID para cada usuario. Primeiro eu precisaria fazer um select das atividades agrupadas por usuário para em seguida pegar o ID máximo. Com \n eu posso fazer assim:\nCom o aggregate e annotate eu também posso fazer o \n em Django:\nMesmo com tantas possibilidades que o ORM do Django nos fornece, algumas vezes precisamos fazer uma consulta mais \"manual\". Podemos realizar consultas utilizando o método \n da seguinda forma:\nNo caso acima não era realmente necessário escrever o SQL da clásula \n manualmente, mas eu o fiz para demonstrar que se não for possível realizar alguma consulta com os métodos descritos anteriormente, você pode utilizar o método \n e escrever a consulta de forma manual. Lembrando que no caso é preciso saber o nome da tabela e se houver parâmetros devem ser passados como no exemplo para que o Django faça o \n para evitar \n.\nO Django também permite se realizar uma consulta \n, isto é, você faz toda a consulta SQL e só vai indicar o modelo que irá representar o resultado dessa consulta, isso é possível utilizando o método \n.\nO uso do \n é interessante quando existe alguma consulta mais complexa em que os valores do campos virão de outras tabelas ou de algum cálculo de alguma função no banco de dados, assim basta que o resultado da consulta tenha os campos que o model tenha.\nEm geral, os bancos de dados relacionais, têm uma série de funções que auxiliam a criação de scripts SQL. Se você deseja utilizar essas funções para fazer cálculos diretamente no seu \n, o Django permite da seguinte forma:\nO parâmetro \n é o nome da função no banco de dados, nesse exemplo esto considerando um banco de dados MySQL onde existe essa função. O parâmetro \n indica que tipo de \n será retornado.\nAinda existe mais coisas a se explorar no ORM do Django mas eu vou parar por aqui, espero que esse artigo lhe ajude a compreender mais as opções que o ORM do Django disponibiliza. Se tiver outras dicas ou críticas comenta ai :)", "category": "tutoriais"},
{"text": "Desde que a biblioteca \n se tornou bastante popular em análise de dados com Python, várias outras libs surgiram para auxiliar a importação de dados para objetos do tipo DataFrame (utilizados pelo Pandas).\nNeste artigo irei comentar sobre duas libs:\n: Facilita a importação de bancos de dados para DataFrame's\n: Prover uma forma simples de acessar diversos datasets públicos - dataset's disponibilizados por bibliotecas da linguagem R\n{% notebook notebooks/datasets-pydataset.ipynb %}\nO db.py faz conexão com os bancos relacionais mais utilizados, mas de acordo com o banco de dados será necessário instalar alguma biblioteca adicional, mais detalhes em:\nNo exemplo abaixo irei utilizar o sqlite3, que é o único que não precisa de nenhuma instalação adicional porque a lib de comunicação já vem com a instalação Python. O arquivo do banco sqlite3 está aqui:\n{% notebook notebooks/datasets-db-py.ipynb %}\nA db.py tem mais algumas opções, basta acessar o link acima e verá que é bem fácil fazer consultas que retornem DataFrame's do Pandas para realizar algum tipo de análise em memória.\nQualquer dúvida ou sugestão basta comentar abaixo!", "category": "tutoriais"},
{"text": "Olá pessoal, eu comecei a mexer com desenvolvimento web quando nem sabia o que era isso, na época da escola fiz algumas coisas com o instito \n no laboratório de informática para a intranet da escola.\nAssim, desde que entrei na universidade o desenvolvimento web se tornou minha zona de conforto. Um dos poucos livros técnicos - associados a alguma disciplina da universidade - que li completamenete foi justamente o de \n do Kurose.\nCom o passar dos anos, passei por ASP, ASP.NET, PHP, Java Web (JSP / JSF)... até chegar em Python/Django em 2009. Como bom minimalista que sou, fiquei apaixonado pela praticidade e simplicidade da linguagem, e a rapidez do framework, chegando assim a minha atual zona de conforto: Desenvolvimento Web com Python/Django. Eu sei que existe um mundo de informações associadas a essa área e essas tecnologias, e ainda tenho muito a aprender mas depois de alguns anos desenvolvendo e \n me senti incomodado, e nos últimos meses tenho buscando novos desafios e oportunidades. Percebi então que já trabalho a algum tempo com estatística e análise de dados imobiliários na \n e que conheço as principais ferramentas científicas utilizadas, principalmente as que envolvem Python:\nhttp://www.numpy.org/\nhttp://www.scipy.org/\nhttp://scikit-learn.org/stable/\nhttp://pandas.pydata.org/\nhttp://matplotlib.org/\nCom isso em mente, comecei a ler bastante conteúdo de \n / \n, e desde dezembro comecei a escrever / montar uma estrutura de projeto de ensino voltado para computação científica aplicada a problemas reais. Infelizmente por causa de outras responsabilidades e fadiga mental estava parado e sem desenvolver a ideia, até que vi este curso: https://wow.thinkful.com/courses/learn-data-science-online/. Me deu uma motivação maior e mais ideias, assim estou voltando meu foco em terminar a base da plataforma \n, para poder migrar o \n para a nova plataforma, e trabalhar em cima do conteúdo desta nova iniciativa.\nSe você está interessado em saber mais o que será discutido nesse projeto e quiser dar a sua opinião, responda o formulário abaixo:\nhttps://docs.google.com/forms/d/1mypRK0lD4L4Dbkpaiw2brkDFx_5tcAqh7NQojfRk-FI/viewform\nPossíveis assuntos:", "category": "cursos"},
{"text": "Olá pessoal, a algum tempo que estou organizando minha agenda para voltar a trabalhar em alguns \n para capturar dados imobiliários que é um tipo de dado que gosto de trabalhar. Assim resolvi publicar esse artigo, que fará parte de uma série de 3, onde irei mostrar como fazer um crawler usando o \n e como armazenar num banco de dados que muito me interessa, o \n.\nO Scrapy é um framework para facilitar o desenvolvimento de crawlers, pois mesmo sendo fácil fazer um crawler usando o built-in do Python como o \n, ou bibliotecas externas como \n, fica mais rápido e prático utilizar um conjunto de ferramentas desenhados para este fim, é o famoso \"batteries included\".\nPara instalar o Scrapy vamos utilizar o pip (supondo que já esteja num \n):\nApós instalar o scrapy você terá disponível o comando \"scrapy\" mais detalhes sobre as opções dele aqui:\nhttp://doc.scrapy.org/en/1.0/topics/commands.html\nO scrapy é composto de \"spiders\" que é a parte do código que irá definir que páginas serão acessadas para capturar informações, \"items\" que são as informações que serão extraídas das páginas e os \"pipelines\" que irão definir como esses \"items\" serão processados.\nUm exemplo simples de um crawler utilizando o Scrapy:\nPara rodar basta utilizar o comando scrapy:\nVocê verá algo assim:\nUma Spider é basicamente uma classe que herda de \n o atributo \n está definindo as urls que devem ser acessadas inicialmente, você pode definir um método \n que deve retornar uma lista de \n através da keyword \n, assim:\nObs: a implementação padrão do \n procura o atributo \n e chama o método \n.\nDeve se utilizar \n e passar um \n para a \n pois o scrapy faz requisições assíncronas, isto é, não espera a requisição inicial acabar para fazer uma nova requisição, e desta forma utiliza o conceito de geradores em Python, você pode ver mais detalhes de como geradores funcionam acessando as palestras de Luciano Ramalho em: http://pt.slideshare.net/ramalho/.\nO scrapy tem o conceito de projeto onde ficam organizados as \"Spiders\", \"items\" e \"pipelines\". Para criar um projeto scrapy basta utilizar o comando:\nVocê verá que uma estrutura de diretórios e arquivos será criada para que facilite o crescimento do seu crawler. Eu criei um projeto chamado \n e meu sistema de diretórios ficou assim:\nAgora vamos criar nosso primeiro Spider, com o comando:\nEstou criando um crawler para capturar os imóveis de Pernambuco (PE) e esta é a url inicial no OLX. Dentro do diretório \n foi criado um arquivo chamado olx.py contendo o esqueleto do nosso código, vou modificar o \n para começar com a url dos imóveis para alugar, o arquivo modificado vai ficar assim:\nPara rodar este código basta utilizar o comando:\nSe antes usamos a opção \n agora que estamos num projeto scrapy usamos a opção \n passando o nome da \n, no caso \n.\nAgora vamos modificar o método \n para adicionar a lógica de verificar os links para os imóveis que a página contém, após isso iremos acessar a página do imóvel para só então capturar os dados do imóvel.\nAgora no método parse usamos \n para percorrer a estrutura do html e encontrar todos os \n que contém a \n css \n, cada elemento deste tipo irá ter um imóvel e assim fazemos um for para buscar o \n do link único para o imóvel. Ao pegar o link de cada imóvel retornamos através do \n uma nova requisição para o scrapy realizar e passamos desta vez outro callback, o \n. Nesse primeiro momento ele apenas vai fazer o log da url.\nRodando novamente o código será possível que o scrapy irá realizar 51 requisições, 1 para cada imóvel - 50 por página - e a primeira para acessar a página inicial.\nApós fazer a lógica de acessar cada imóvel vamos adicionar a parte de verificar se existe uma próxima página, visto que são exibidos 50 imóveis por página mas no final da página há uma paginação.\nO código ficará assim:\nObs: Atualizei o código com a dica do \n sobre o \n, essa função do \n serve para remover o excesso de caracteres em branco e outros caracteres que a renderização do html ignora mas que está presente no código fonte.\nVeja que após o \n usamos novamente o xpath para encontrar o link que contém o texto \n que está no final da página do OLX - basta examinar o html. Se houver o link mandamos outra requisição ao scrapy, só que desta vez o callback é o mesmo método que estamos, o \n. Para acrescentar fazemos o log do título do imóvel, dando uma ideia de como podemos pegar outras informações sobre o imóvel, mais detalhes sobre isso no próximo artigo.\nPara rodar, basta novamente enviar o comando:\nPara perceber que o scrapy é assíncrono nas suas requisições, basta ver que ele acessar a próxima página antes de acabar as requisições dos imóveis da primeira página.\nEnfim, essa primeira parte fica por aqui, na próxima irei mostrar os conceitos de \n e \n que o scrapy possui para capturar e processar os dados armazenados.", "category": "tutoriais"},
{"text": "Olá pessoal, esta é a parte II da série sobre o Scrapy, abaixo os links para todos os artigos da série:\nNa parte I mostrei como instalar/configurar e rodar seu projeto scrapy no site do OLX. Nesse artigo vamos ver como salvar as informações resgatadas do crawler.\nAntes de ir ao código é importante frisar que o Scrapy sempre que recebe um \n dentro de uma \n irá realizar outra requisição, entretanto se ao invés disso, você retornar um dicionário ou um objeto que herde de \n, o Scrapy irá entender que aquele \n acaba de resgatar uma informação que deve ser processada e vai enviar esse item ou dicionário para a fila de processamento - os \n.\nDentro do \n que definimos no último \n, nós vimos como pegar uma informação da requisição via \n e exibir essa informação no nosso log, agora vamos fazer a lógica de informar ao Scrapy que dados estamos coletando e por fim vamos criar um \n para processar esses dados.\nO código ficará assim:\nA grande mudança é que agora nós estamos coletando bem mais informações sobre o imóvel, ainda da forma \n mas limpeza desses dados ficaria para um possível tratamento estatístico... Estamos criando um dicionário chamado \n e no final usamos o \n para retorná-lo. A primeira informação que está sendo guardada são as fotos, quer dizer, os links para as fotos, utilizando o \n ou invés do \n pois provavelmente irá retornar mais de um elemento no \n da fotos.\nTodas as outras informações são simples de coletar, basta um pequeno \n utilizando a função \n para remover caracteres indesejados como \n* a única informação que necessita de algo diferente é a data, ela não está num formato interessante mas conseguimos pegar ao menos o dia, mês e hora utilizando a expressão regular presente na linha \n. Como não tenho certeza se todos os imóveis irão cair nessa regex, faço uma pequena verificação se a regex obteve êxito.\nAgora que estamos retornando nossas informações basta rodar novamente o crawler:\nDevemos ver algo assim:\nPor padrão o Scrapy irá apenas logar a informação coletada, vamos agora implementar um pipeline para armazenar a informação no banco da dados \n. Eu resolvi utilizar o rethinkdb porque gosto de experimentar novos bancos de dados e ele tem diversos aspectos interessantes do NoSQL e algumas facilidades dos bancos relacionais clássicos, em outro artigo eu entro em mais detalhes sobre esse banco de dados - qualquer coisa basta citar essa escolha nos comentários - por hora basta saber que ele armazena documentos no formato JSON.\nPrimeiro precisamos baixar e instalar, algo que é bem simples, basta acessar o site oficial e escolher o pacote para o seu sistema operacional:\nhttp://www.rethinkdb.com/docs/install/\nApós a instalação é preciso colocar o rethinkdb para rodar, basta digitar o comando:\nCom o banco de dados rodando você tem acesso a uma interface administrativa acessando:\nhttp://localhost:8080/\nEu prefiro colocar o banco de dados parar rodar só quando vou utilizar, faço isso tanto com os relacionais quanto os não-relacionais mas se desejar pode iniciar o rethinkdb assim que iniciar o sistema:\nhttp://rethinkdb.com/docs/start-on-startup/\nCom o banco de dados rodando, devemos acessar a interface administrativa e criar um banco de dados chamado \n. Depois de criado o banco, vamos instalar o driver do rethinkdb:\nAgora vamos adicionar às configurações do nosso projeto Scrapy, arquivo \n, as informações de acesso ao rethinkdb e a configuração \n indicando o pipeline que iremos criar.\n{% highlight python %}\nRETHINKDB = {\n    'table_name': 'items', 'db': 'scrapy_olx'\n}\nITEM_PIPELINES = {\n    'scrapy_olx.pipelines.RethinkdbPipeline': 1\n}\nCada classe que irá ser um \n pode implementar 4 métodos:\nNo método \n nós temos acesso a todos os principais componentes do Scrapy, incluindo as configurações e por isso implementamos este método para pegar as informações de acesso ao rethinkdb.\nNos método \n e \n fazemos a abertura e fechamento da conexão com o rethinkdb, para evitar erros há uma pequena verificação se a tabela já existe no banco de dados, caso não exista ela é criada.\nFinalmente no método \n inserimos o item no banco de dados, o rethinkdb aceita dicionários que tem uma estrutura semelhante aos JSON's que é a forma de armazenamento dele.\nAgora vamos rodar novamente o crawler:\nO crawler deve rodar durante algumas horas mas ao acessar a interface administrativa do rethinkdb irá perceber que o número de documentos indicados na tabela \n vai aumentando.\nNeste artigos vimos como retornar ao Scrapy as informações coletadas, depois tivemos uma visão geral do rethinkdb um banco conhecido como \n, ele é open-source e construído para aplicações web em tempo real.\nPor fim fizemos um pipeline para ver como podemos processar um item coletado pelo crawler, utilizamos todos os 4 métodos que podem ser implementados pelo pipeline e são chamados pelo Scrapy.\nNo próximo artigo iremos ver como fazer deploy do projeto Scrapy, pois normalmente não é interessante deixar o crawler rodando na sua máquina, o mais comum é colocar em algum servidor na nuvem.", "category": "tutoriais"},
{"text": "Olá pessoal, na sexta-feira passada - 24 de julho - participei da Campus Party Recife que aconteceu no Centro de Convenções de Pernambuco. No evento eu falei sobre Python e Educação, citando alguns exemplos do uso de Python nas universidades e escolas, e falei sobre o \n.\nInfelizmente tive alguns problemas com meu computador e não consegui fazer um demo online para mostrar a simplicidade de Python e seu uso em diversos ambientes, felizmente consegui fazer um workshop posteriormente e mostrei alguns usos de Python com redes sociais, no caso o Facebook.\nA palestra foi gravada e está disponível no youtube - player abaixo:\nEu preciso melhorar essa palestra colocando alguns pontos que já observei que faltou, quem quiser me ajudar usa os comentários, pois irei fazer uma palestra parecida num evento da UFRPE.\nPontos:\nFalar do mercado atual de Python e suas oportunidades\nFalar sobre os cursos em inglês do coursera, udacity, edx...\nMencionar o uso de Python na criação de games que estimulam o ensino\nVender meu Mac e volta a usar Linux ... (alguém ai afim de comprar?)", "category": "palestras"},
{"text": "Esse texto é uma espécie de resposta/indicação do texto abaixo:\nhttps://medium.com/hackerpreneur-magazine/4-invisible-user-experiences-you-d13cc9c3c7ab\nEu sempre fui (e sou) fã declarado de design minimalista, perdi a conta de quantas noites fiquei pesquisando sobre o tema, vendo projetos - principalmente web - e admirando os incríveis detalhes que passam de maneira quase invisível. Para mim um bom design é aquele que passa despercebido mas que torna a experiência, a qual foi desenhado, incrível - seja num website, notebook, smartphone, sofá...\n~~Muitas~~ algumas pessoas associam um bom design a algo \"bonito\", cores fortes, layout agressivo, mas para mim se o design não tiver um objetivo claro e for simples, eu preferia algo assim:\nhttp://motherfuckingwebsite.com/\nO exemplo acima é sobre web design, mas minha preferência e crítica não se resume apenas a este tipo de design, eu vejo esta associação desde simples cartões de visita à cadeiras ou sofás. Entretanto eu vejo uma tendência crescente a adoção deste estilo minimalista / objetivo tanto em objetos digitais quanto reais. As pessoas estão utilizando cada vez mais a máxima: \n.\nUm bom design não é apenas objetivo e claro, ele é invisível. A pesquisa do Google é um excelente exemplo de design invisível, um simples formulário (preto no branco) - em alguns dispositivos é substituído pelo reconhecimento de voz tornando-o mais simples ainda. Mesmo com a possibilidade de ficar dentro de uma \n, o Google entrega o que você quer de forma objetiva e rápida, corrigindo até o seu texto caso esteja errado. Dependendo da sua busca ele já faz um pequeno resumo ao lado dos resultados com opções bem relevantes para o tipo da pesquisa entre outras coisas que ficam imperceptível para a maioria das pessoas.\nEste é o tipo de design que funciona, para mim é o estado da arte que deve ser cada vez mais copiado, no link que mencionei acima tem mais alguns bons exemplos. Todavia, existe uma área que eu gosto bastante entretanto conheço poucos bons exemplos de design, é a área de educação - principalmente o método de ensino a distância.\nRecentemente eu comecei a ver alguns bons exemplos de ensino a distância e o mais incrível é que o grande diferencial não é a plataforma utilizada - cheia de recursos. O que faz a diferença é a didática, é fazer com que o ensino a distância não seja apenas uma extensão da sala de aula, transformando a experiência analógica em digital de verdade. Cursos que focam em vídeo-aulas, as quais são simples gravações de slides, normalmente têm uma baixa qualidade no design / usabilidade. Esses bons exemplos que eu mencionei - mas não indiquei - extrapolam essa virtualização da sala de aula, eles utilizam técnicas bem implementadas de \n (\n),  estimulam a formação de grupos de estudo direcionado, utilizam todos os canais de comunicação de maneira inteligente, conduzem o curso com base em pequenos projetos ou entregas fazendo com que o aluno pratique o conhecimento adquirido. Essa experiência diferenciada faz parte de um planejamento de design, que não necessariamente foi realizado por um designer, pois essa noção de design/usabilidade deve ser algo natural de todos.\nInfelizmente hoje eu percebo que apliquei muito pouco do meu gosto e estudo nos projetos que trabalhei - às vezes porque me faltou atenção aos detalhes, outras foi pelo simples fato de não me preocupar em entregar algo que não seja realmente bom (na minha concepção) - e isso é algo que me arrependo.", "category": "utils"},
{"text": "Parte I - http://gilenofilho.com.br/tecnicas-de-regressao-aplicadas-a-avaliacoes-de-bens-com-python-parte-i/\nNa primeira parte desta série eu escrevi de forma bem simples sobre o que seria a regressão linear mútipla e a Engenharia de Avaliações. Fui bem objetivo pois este assunto é bastante longo e eu achei melhor deixar algumas referências caso tenham interesse em se aprofundar.\nNesta segunda parte irei mostrar como funciona a avaliação de bens no Brasil. Ela é regida por normas técnicas da ABNT (Associação Brasileira de Normas Técnicas), essas normas são criadas por comissões de estudo formadas por produtores, consumidores e neutros (laboratórios, universidades e outros). No caso das normas para avaliação de imóveis que é a área que tenho mais interesse, elas foram construídas por uma comissão de estudo da construção civil, abaixo seguem as normas da área:\nOs principais métodos aprovados pela normal são os seguintes:\nÉ o método que identifica o valor de um bem através do tratamento técnico dos atributos que o constitui comparando-os com uma determinada amostra, isto é, o bem é avaliado com base na comparação direta de seus atributos com os atributos de uma amostra a qual têm já definido os seus valores. Na \n quando eu mostrei a regressão linear, eu estava demonstrando o uso do método comparativo.\nA norma permite outras formas de avaliação utilizando-se de dados do mercado, por exemplo, é possível utilizar uma rede neural. Além de disso a norma também explica detalhes técnico-científicos para que uma avaliação seja qualificada, isto é, existe uma formalidade metodológica para a avaliação.\nEste método identifica o valor do bem com base num estudo de viabilidade técnico-econômico considerando o seu aproveitamento eficiente. Um exemplo seria uma avaliação de uma \n, onde o método considera os custos de urbanização, impostos, lucro entre outros fatores para a criação de um empreendimento, no caso a venda de lotes. No fim, é possível chegar ao valor da Gleba e assim a avaliação.\nO método evolutivo trabalha em cima do somatório dos componentes do bem a ser avaliado, para o caso de obter o valor de mercado se faz necessário adicionar um fator de comercialização que irá multiplicar o somatório. O somatório seria o valor de reedição ou custo de reprodução do bem nos dias atuais, isto é, considerando fatores de depreciação por exemplo.\nEsta parte II ficou apenas na teoria, foi uma breve (\n) conversa sobre Engenharia de Avaliações. Na verdade eu deveria ter começado com essa parte teórica mas como meus pensamentos são turvos comecei do meio e voltei ao início. Nas próximas partes irei detalhar cada método e implementá-lo em Python, mas o foco será o método comparativo de mercado, pois como o título do artigo diz, a ideia é ver técnicas de regressão.", "category": "tutoriais"},
{"text": "Neste último fim de semana, 4 a 9 de novembro, ocorreu a PythonBrasil[10] em Recife/Porto de Galinhas. O sucesso do evento se repetiu, mas dessa vez teve um prazer especial por ser no meu estado.\nÉ sempre bom rever os amigos de outros estados, trocar ideias e aprender mais sobre python e seu ecossistema. Eu considero esse evento obrigatório para qualquer um que deseje entrar no mundo Python, porque o forte de Python é justamente a comunidade. Sempre que saio de eventos desse tipo, minhas energias se renovam e dá vontade de sair programando logo em seguida, testar as novidades aprendidas, aprimorar os negócios ...\nA melhor parte do evento é justamente os bastidores, as conversas nos bares, a troca de ideias após as palestras. É a oportunidade de fazer novos negócios, tirar dúvidas com pessoas que você só conhecia pelas listas de discussões e é como Silvio Meira diz, \n. E a minha palestra foi de certa forma relacionado a esse ambiente de inovação, eu não tenho a mesma propriedade que \n mas segue minha contribuição:\nObs: As referências é a parte mais importante da palestra e eu estou repetindo elas abaixo (estão nos slides):\nhttp://www.paulgraham.com/ds.html\nhttp://boletim.de/silvio/inovao-criao-coletiva/\nhttp://casjam.com/stop-starting-start-growing/\nhttps://medium.com/brasil/o-que-nao-me-falaram-sobre-empreendedorismo-cc5b7ddbdf5e\nhttps://medium.com/@murilogun/criatividade-nao-e-dom-889ed38e30ba\nhttps://medium.com/brasil/como-ter-largado-meu-emprego-para-abrir-minha-tao-sonhada-startup-ferrou-com-a-minha-vida-4394130cfa49\nhttp://unicornfree.com/2014/done-should-be-spelled-f-a-i-l", "category": "palestras"},
{"text": "Parte I - http://gilenofilho.com.br/iniciando-um-projeto-django-arquitetura-organizacao-e-dicas-parte-i/\nOlá pessoal, na primeira parte desta série eu mostrei a motivação desta série e como usar um template de projeto django para iniciar seu projeto com uma estrutura inicial melhor do que a básica fornecida pelo django.\nNesta segunda parte eu atualizei o repositório do projeto adicionando uma view básica na app \n e adicionei uma templatetag de paginação bem simples que eu uso em alguns projetos. Existem algumas apps para paginação mas por simplicidade eu utilizo essa templatetag.\nRepositório: https://github.com/gileno/django-template-project\nA templatetag de paginação é de fácil uso e funciona com a generic view: \n. Ela precisa que esteja no contexto do template as variáveis \n e \n que é o padrão da \n.\nTambém adicionei a app \n que é simplesmente fantástica para teste, é aquela típica app que você se pergunta porque não criou antes.\nNo models.py da app \n adicionei um model base que tem dois campos, uma para armazenar a data de criação e outro para a data de modificação, normalmente todos os models herdam dele.\nNa próxima parte eu irei adicionar uma app de usuários usando o sistema de compatibilidade de django. Eu não gosto de usar a padrão do django por causa da não obrigatoriedade do campo e-mail no User e pela necessidade de criar um outro model sempre que precisar armazenar mais informações do usuário, como foto, cpf ...", "category": "tutoriais"},
{"text": "Olá pessoal, no último dia 22 de novembro ocorreu o 35º encontro do PUG-PE. O evento ocorreu no auditório do DEINFO na UFRPE, onde já realizamos alguns eventos, houveram 4 palestras:\nPython e Interfaces Gráficas (Daivid)\nAnálise de Dados com Pandas (Gileno)\nEsteganografia (Lincoln)\nBioinformática (Marcel)\nFoi um evento pequeno - 15 pessoas - mas é incrível como mesmo em pequenos encontros é possível aprender tanto e sair renovado com ideias e motivações, e muito disso se deu pelo contato com o professor \n. Numa conversa sobre Bioinformática - iniciada numa palestra de \n sobre a \n - ele (Jones) mostrou como é possível fazer inovação utilizando-se de uma base acadêmica/científica que agrega valor ao seu produto ou serviço de uma forma que dificilmente pode ser copiada, \n fala bem sobre isso nesses links:\nhttp://www.ikewai.com/WordPress/2012/05/30/graal-the-search-for-grand-algorithms-in-truly-global-software-markets/\nhttp://www.ikewai.com/WordPress/2012/09/18/precisamos-inovar-mais-como/\nÉ com muita felicidade que eu estou vendo muitas pessoas ao meu redor que estão com ideias sobre empreendedorismo e inovação como as minhas. Ideias sobre a necessidade de um estudo, uma pesquisa científica aplicada a resolver problemas reais, diferentemente do que muitas startups estão fazendo por ai. Num próximo artigo eu irei comentar mais esse assunto que muito me interessa na atual fase que estou vivendo.\nOs slides da Palestra de Marcel podem ser acessados em:\nhttp://www.slideshare.net/marcelcaraciolo/como-python-ajudou-a-automatizar-o-nosso-laboratrio-v2\nAlém disso, aprendi sobre \n com \n e fiquei muito motivado a fazer alguns truques em imagens por ai :). Os slides dele podem ser acessados em:\nhttps://speakerdeck.com/demacdolincoln/esteganografia-o-que-e-e-o-que-ja-vi-em-python-sobre-o-assunto\nTambém tivemos uma conversa com \n sobre Python e interfaces gráficas para iniciar as pessoas que não conheciam ou estavam engatinhando com Python, os slides dele estão em:\nhttps://www.dropbox.com/s/iw0ipl7ob4d7kvb/Apresenta%C3%A7%C3%A3o%20-%20wxPython.pdf?dl=0\nA minha palestra não teve slides, pois foi uma palestra prática, mas em breve irei criar um tutorial legal sobre \n e publicar por aqui.\nEnfim, esse evento foi marcante para eu começar a traçar meu plano de dominação mundial e espero que em breve comece a compartilhar com vocês.", "category": "palestras"},
{"text": "Ultimamente tenho gostado bastante de discutir esse tema: Mercado x Academia. E depois de ver os links abaixo, fiquei motivado a escrever:\nhttps://groups.google.com/forum/#!topic/python-brasil/373Fh7eVS0w\nhttp://blog.txus.io/2014/10/programming-and-computer-science-an-imminent-divorce/\nEu comecei a programar de verdade quando entrei na universidade (Ciência da Computação - \n), ela foi minha porta de entrada no mundo da computação - antes eu só fazia umas páginas estáticas no falecido \n.\nHoje em dia eu vejo muitos programadores começarem por cursos técnicos e/ou através da simples curiosidade executada em buscas no google. Isso é fantástico, pois programação não deveria ser apenas para universitários de cursos de ciência da computação e correlatos, acredito que programação deveria ser uma matéria básica como matemática, ou talvez um dos tópicos desta disciplina.\nEntretanto eu tenho visto um problema nesse cenário: os programadores estão desvalorizando demais a universidade, estão cometendo o mesmo erro que alguns acadêmicos mais conservadores. Da mesma forma que eu sou contra fazer pesquisa, gerar conhecimento e não entregar algo a sociedade, seja em forma de produto ou  conclusões/previsões, também não concordo em partir para o mercado sem pesquisa, sem uma base de conhecimento necessária para gerar algo interessante, algo inovador.\nEu entrei na universidade em 2006.2 e até o 6º período/semestre, cursei normalmente a universidade, isso foi muito bom pois me deu uma base significativa, e eu devo muito a qualidade do meu curso. Após esse semestre eu fiquei mais longe distante do curso por motivos pessoais e porque comecei a trabalhar mais intensamente.\nUm dos meus trabalhos foi na startup Atepassar, que hoje não está mais ativa. Lá comecei a ficar cada vez mais empolgado com ter meu próprio negócio, tocar algum projeto pessoal, e isso fez com que eu me afastasse da universidade e em alguns momentos tivesse até raiva, porque para mim a universidade deveria entender que eu tinha pouco tempo e os projetos e aulas deveriam ser mais amenas, doce ilusão.\nHoje eu tenho uma visão bem mais madura de alguns anos atrás, se antes eu achava que a universidade era burocrática, chata e uma geradora de artigos sem utilidade, agora eu penso que a universidade tem como principal função alimentar a ciência, a pesquisa científica como forma de gerar conhecimento, obviamente eu não estou falando de faculdades/universidades que são apenas \"entregadoras de diploma\", estou falando de instituições sérias que se preocupam com o aluno e têm responsabilidade social.\nInfelizmente, mesmo nessas instituições sérias, é comum encontrar pessoas que buscam apenas criação de artigos que não têm uma boa base de pesquisa, um estudo realmente interessante. Mesmo sabendo que no Brasil a moeda nas universidades são artigos científicos, é possível priorizar qualidade sobre quantidade e ainda sim ter uma boa carreira acadêmica, eu conheço vários bons exemplos no CIn/UFPE e na \n. Pessoalmente, conheço alguns professores que levaram suas pesquisas ao mercado em forma de consultorias e empresas (mesmo que oficialmente eles não possam ter empresas), e conseguiram bastante sucesso, como sucesso é algo muito relativo, entenda como um negócio sustentável, lucrativo e de bom alcance.\nFinalmente o que eu quero concluir é que é possível trabalhar bem os dois lados, aproveitando as oportunidades que o mundo acadêmico fornece e levá-las ao mercado para gerar inovação. Mas esse conhecimento acadêmico/científico não precisa se restringir a universidade, a formalidade de curso de graduação ou pós-graduação, você pode adotar a metodologia científica no seu dia a dia e juntamente com o \n de mercado criar excelentes produtos e serviços. Com a quantidade de cursos de excelente qualidade que plataformas como \n, \n e \n oferece é até vergonhoso dizer que não consegue estudar porque não têm dinheiro ou não consegue passar em um vestibular.\nEnfim, para mim o ideal é sempre tentar mesclar as duas visões para criar \n com excelência e eu tenho buscado isso cada vez mais nos meus projetos.\nComo leitura complementar eu indico os textos de \n que dispensa apresentações:\nhttp://boletim.de/\nhttp://www.ikewai.com/WordPress/2012/09/18/precisamos-inovar-mais-como/\nhttp://www.ikewai.com/WordPress/2012/05/30/graal-the-search-for-grand-algorithms-in-truly-global-software-markets/", "category": "utils"},
{"text": "Olá pessoal, este último dia 17 - 17/05/2014 - aconteceu o 33º Encontro do PUG-PE (Python User Group Pernambuco). Eu dei uma palestra sobre bibliotecas científicas com Python, foi uma palestra bem simples e genérica mas deu para ver um exemplo de uso delas com a criação de um classificador KNN (K Nearest Neighbors).\nAbaixo segue a palestra:\nO link para o código no github:", "category": "palestras"},
{"text": "Olá pessoal, no sábado passado (24/05/2014), eu e \n demos um workshop de Python na Faculdade Santa Emília - FASE. Mostramos uma visão geral sobre Python e o seu ecossistema, após a apresentação começamos a mostrar exemplos de código em Python e demonstrando o seu poder em diversos ambientes: Desktop, Web, Computação Científica ...\nEsse workshop faz parte de uma sério de workshop's que iremos fazer em Recife e região metropolitana para divulgar os cursos presencias que irão ocorrer em Julho, após a Copa do Mundo de Futebol.\nO código está no github: \nE os slides estão abaixo:", "category": "cursos"},
{"text": "Os últimos dois semestres da Universidade Federal de Pernambuco (UFPE), 2013.2 e 2014.1, os alunos do curso de Sistemas de Informação (SI) do CIn/UFPE (Centro de Informática da UFPE) que reprovavam a disciplina de Introdução a Programação com Java (IP), cursavam no semestre posterior uma disciplina extra de IP que usava Python ao invés de Java como linguagem. Eu participei dessas turmas extras como monitor do professor \n, e me senti muito feliz em saber que no semestre de 2014.2 os resultados foram satisfatórios e agora a disciplina de IP não será mais com Java e sim com Python.\nEntretanto o que eu percebi é que não é apenas usando Python como primeira LP que é possível melhorar o ensino de programação nas universidades, a melhora está na metodologia, no espírito de comunidade e na cultura que essa linguagem representa, e isso eu posso representar em 2 termos: Software Livre e Comunidade Apaixonada.\nQuando foi anunciado que a disciplina de IP teria uma turma extra com Python, muitos membros da comunidade Python se dispuseram a ajudar, logo surgiram muitas ideias e possibilidades. Eu, que estava afastado da universidade, fiz questão de ajudar e tive uma liberdade muito grande do professor para levar o meu conhecimento acadêmico e profissional à disciplina como monitor. O professor deixou a disciplina muito mais prática, houve até uma pequena maratona de programação (salve as devidas proporções).\nEnfim, o que eu aprendi é que uma linguagem de programação é apenas uma ferramenta, mas como tal, deve ser cuidadosamente escolhida para um melhor aproveitamento e para mim Python é a melhor linguagem para o ensino de programação em cursos de Computação, não falo de modo geral porque pode (e deve) existir melhores formas de ensinar programação em outros ambientes.\nComplementando para quem não viu, Python se tornou a linguagem mais popular no ensino de programação das principais universidades dos Estados Unidos:\nhttp://cacm.acm.org/blogs/blog-cacm/176450-python-is-now-the-most-popular-introductory-teaching-language-at-top-us-universities/fulltext\nAlém de mim e do professor Airton, houveram outros monitores e professores envolvidos que foram importantes para essa mudança, mais detalhes podem ser vistos na página da disciplina: https://sites.google.com/site/if968isturma2/", "category": "cursos"},
{"text": "Esse é um post migrado do Medium.\nNa estatística, a \n é um meio de inferir o valor de uma dada variável dependente com base em variáveis independentes, também chamadas de variáveis explicativas. Em outras palavras, a ideia é gerar um modelo que possa explicar o comportamento de determinado conjunto de dados, em perspectiva de uma variável, na avaliação de bens, a variável tende a ser o preço do bem a ser avaliado.\nA \n é o ramo da engenharia que se concentra em estudar as diversas formas de se gerar o valor de um bem — avaliação do bem — e em geral é associada a avaliação imobiliária mas pode ser usada para avaliar outros bens como: máquinas, empresas, veículos…\nExistem modelos de regressão que usam inferência estatística e outros que usam técnicas de inteligência artificial — como uma rede neural que pode ser usada tanto para classificação como para regressão. Nesta primeira parte irei mostrar o modelo clássico de regressão linear múltipla[1][2] — usando o método dos mínimos quadrados[3] — uma técnica estatística que visa gerar um modelo matemático — função linear — que será usada para inferir o valor da variável dependente com base nas variáveis independentes, o final o modelo fica assim:\nNo modelo, o Y chapéu é a variável dependente, os X's são as variáveis independentes, o beta zero é o intercepto e os outros beta's são os parâmetros gerados pelo modelo que indica o declive da reta de regressão em relação a variável que ele está associado.\nO método dos mínimos quadrados (MMQ) ou Ordinary Least Squares (OLS), é uma otimização matemática que visa minimizar a soma do quadrado dos erros, aproximando a equação linear para o conjunto de dados [3] — este link da wikipédia explica em detalhes como é feito essa regressão. Está é uma versão geral, para mais detalhes olhar as referências.\nEm python temos algumas bibliotecas que já fazem a regressão linear:\nhttp://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.linregress.html\nhttp://pysal.readthedocs.org/en/v1.7/library/spreg/ols.html\nMarcel Caraciolo fez um artigo em inglês muito bom fazendo uma implementação em Python, vale a pena conferir: http://aimotion.blogspot.com.br/2011/10/machine-learning-with-python-linear.html\nUma simples implementação de regressão usando a biblioteca científica \n — apenas para uso didático:\nhttps://gist.github.com/gileno/1b58b43e7b1d13eabfaa\n[1] DANTAS, Rubens Alves. Engenharia de Avaliações — Uma Introdução à Metodologia Científica. 1ª Edição, Editora Pini, 1998\n[2] http://pt.wikipedia.org/wiki/Regress%C3%A3o_linear\n[3] http://pt.wikipedia.org/wiki/M%C3%A9todo_dos_m%C3%ADnimos_quadrados", "category": "tutoriais"},
{"text": "Olá pessoal, quando eu comecei a trabalhar com Django uma das minha maiores dúvidas era em relação a arquitetura de um projeto, organização dos arquivos, diretórios e coisas do tipo. O comando \n só criava 4 arquivos e eu ficava com dúvida em como seria a arquitetura de um grande projeto. Eu estava acostumado com a burocracia de Java e C#, eram muitas classes abstratas e interfaces, acredito que hoje isso tenha melhorado mas na minha época era muita complexidade, tanto que eu usava template de projeto que não conseguia entender boa parte do código e isso era algo que me fazia infeliz nessas linguagens, mas isso fica para outro artigo.\nFelizmente eu comecei a trabalhar no \n, esse projeto foi fechado por problemas internos mas isso é outra história. Lá eu vi que a simplicidade com que eu usava Django não era porque eu estava começando, para meu espanto Django era simples mesmo, assim como Python. Entretanto tinham alguns detalhes na organização do projeto que na época não eram muito claros para mim. Havia liberdade mas como eu era iniciante eu queria alguma indicação de como organizar meu projeto.\nHoje se você procurar por \"\n\" no google, vai ver diversos exemplos de projetos e a partir da versão 1.4 foi disponibilizada uma forma de no \n indicar a estrutura inicial do projeto, que já foi um grande avanço na organização do projeto.\nPrimeiramente eu irei mostrar o template de projeto que eu utilizo: https://github.com/gileno/django-template-project. A versão desse post vai até o commit: https://github.com/gileno/django-template-project/tree/ad4c0978a09cd8aa510e1555f06baf53a5ee9faa, como estou sempre atualizando o master já não está tão simples.\nPara usá-lo, rode o \n da seguinte forma:\nSubstitua o \n pelo nome do seu projeto. Esse meu template tem uma base de um outro criado pelo \n:\nhttps://github.com/allisson/django-project-template\nEu adaptei para algumas necessidades minhas e adicionei algumas funções, templatetag's e uma app base, \n. Nessa primeira parte eu vou apresentar apenas a estrutura base do projeto e a app \n.\nA estrutura base não tem uma pasta para para os templates pois eu uso a pasta \n dentro da app \n a mesma coisa eu faço para os arquivos estáticos, usando a pasta \n, isso evita criar uma pasta templates e uma static fora das apps, além de evitar alterar duas settings: \n e \n.\nEu também adiciono um Makefile para algumas tarefas, normalmente têm mais opções mas esse do template é uma versão simplificada. Além disso, vão alguns arquivos de configuração que serão utilizados no servidor, como o \n e o \n, por fim adiciono um gunicorn_start que é um shell script que será utilizado para levantar o processo do gunicorn.\nEnfim, nesta primeira parte eu mostrei apenas a base do template de projeto que eu utilizo, ainda faltam alguns utilitários, como: funções, templatetag's, models...\nParte II - http://gilenofilho.com.br/iniciando-um-projeto-django-arquitetura-organizacao-e-dicas-parte-ii/\nAtualizado: Ao postar esse artigo no PUG-PE o \n me indicou o \n e mencionou que existe um para o django \n. Por hora o sistema atual do django é suficiente para mim e eu costumo ser preguiçoso, isto é, procuro o mais simples e direto possível, mas no final da série é provável que faça uma versão final usando o cookiecutter.\nNo dia 11 de novembro irá iniciar uma nova turma do meu curso de Django pelo PyCursos. Iremos utilizar Python 3 e a versão mais atual do Django 1.6 e 1.7. Mais detalhes em:\nhttp://pycursos.com/django/", "category": "tutoriais"},
{"text": "Olá pessoal, na quinta-feira 26/09/2013 ocorreu o IV Workshop da empresa júnior de engenharia de produção da UFRN, com o tema: \"Transforme sua insatisfação em próposito\"\nO Pingmind foi um dos convidados e eu fui lá representá-lo. Na ocasião não tinha feito slides mas acabei montando posteriormente os slides com base nos tópicos que citei na palestra, segue abaixo os slides:", "category": "palestras"},
{"text": "Olá pessoal, hoje eu dei aula de monitoria para a primeira turma de IP (Introdução a Programação) do CIn (Centro de Informática) - UFPE que está adotando Python como primeira LP (linguagem de programação).\nPor enquanto apenas o curso de Sistema de Informação que está testando o uso de Python como primeira LP e em modo de teste, tradicionalmente os cursos do CIn tem Java como primeira LP e recentemente para o curso de Engenharia de Computação mudou para C.\nHoje foi uma aula bem simples sobre arquivos e eu fiz alguns slides para guiar e servir como revisão. Abaixo segue os slides no \n:", "category": "cursos"},
{"text": "Olá pessoal, infelizmente por padrão a instalação de Python não vêm com os mecanismos para isolamento de um ambiente, evitando conflitos de versões entre bibliotecas de tercerios e até da versão Python utilizada em diferentes projetos. Assim resolvi fazer um vídeo que se encaixa na categoria do \"Minuto Python\", promovido pela \n, falando de forma rápida como usar o gerenciador de pacotes python (pip), criar um ambiente virtual com virtualenv e usar os atalhos oferecidos pelo virtualenvwrapper para facilitar a criação de ambientes virtuais.\nAbaixo segue o vídeo do youtube", "category": "tutoriais"},
{"text": "Olá pessoal, eu resolvi deixar público uma aula do meu curso de \n no \n para o pessoal ver a minha didática e ter uma ideia de como as aulas são gravadas. Essa aula faz parte do desenvolvimento de uma aplicação chamada Simple MOOC, que é uma plataforma de ensino a distância. A ideia dessa plataforma é ser o mais simples e objetiva possível mantendo funcionalidades básicas para o ensino a distância, no curso cada aula eu divido em 4 ou 5 vídeo aulas de curta duração para deixar o curso mais dinâmico e o usuário poder acessar a qualquer momento, sem aquela necessidade de ter muito tempo livre para poder estudar.\nAlém das vídeo-aulas o curso é composto por códigos de exemplo, slides, uma wiki com alguns tutoriais, fórum de dúvidas exclusivo do curso, onde eu respondo a todas as dúvidas rapidamente e os alunos também costumam interagir e dar boas sugestões e soluções para os problemas.\nO curso tem um foco bem prático onde iremos ver os conteúdos descritos na ementa de uma forma dinâmica de acordo com o desenvolvimento da aplicação Simple MOOC. Apesar de ser um curso de backend (Python/Django), eu também exploro um pouco de html/css usando um framework css chamado \n e fazendo ajustes no css sempre que necessário. O curso pode ser acessado de qualquer lugar com acesso a internet e sem limitações de acesso e o fim do curso não é determinado, eu sempre fico atualizando os conteúdos e o aluno poderá acessar todo o conteúdo por tempo indeterminado.\nPara se inscrever no curso acesse: \nAbaixo seguem as vídeo-aulas em ordem:", "category": "cursos"},
{"text": "Olá pessoal, recentemente migrei alguns sistemas (PyCursos e Pingmind) da \n (Amazon Web Services) para a \n e vou falar um pouco sobre essa experiência.\nA migração não foi uma decisão fácil, afinal nunca problemas com a AWS - apenas 1 em 2 anos de uso - e a AWS oferece muito mais do que simplesmente uma VPS Linux, ela tem diversos serviços como o \n e o \n que tiram a responsabilidade do desenvolvedor de gerenciar alguns recursos e ferramentas. Mas então porque sair da AWS? A primeira coisa é o custo, em muitos casos não irá compensar mas no meu caso passei de uma conta de $ 160 - $ 190 por mês para exatos $ 45 (+ $ 60 por ano do \n), uma economia considerável. Engraçado é que depois que eu mudei para a DigitalOcean o \n baixa os preços e coloca SSD, se tivesse feito antes é provável que eu voltasse para o Linode (usava ele antes da AWS).\nOutro fator é a dependência com a AWS, conversando com um professor da UFPE da área de sistemas distribuídos, ele comentou essa questão da dependência com empresas de Computação na Nuvem. As empresas oferecem diversos serviços extra (considerando que uma VPS é o básico) e quando você precisa mudar sua arquitetura ou trocar de ferramenta você terá muitos problemas, e de fato isto aconteceu comigo. Tive problemas na organização dos arquivos estáticos que antes eram servidos pelo S3 e os vídeos que usavam o \n. Felizmente o código está razoavelmente estruturado e genérico - na medida do possível - e para os vídeos que eram o maior problemas migramos para o Vimeo - particularmente uma das melhores coisas que eu já fiz na minha vida.\nDe modo geral foram esses os argumentos mais fortes que me fizeram fazer essa mgiração, mas houveram outros pequenos detalhes como armazenamento em SSD, API simples e mais direta - existem menos serviços - suporte via e-mail muito bom e uma área para a comunidade com fórum e tutoriais.\nNo fim, o que eu desejo passar neste post é o seguinte: antes de contratar um provedor de nuvem, análise todos os aspectos técnicos e financeiros dele, por mais que AWS seja muito boa eu me sinto muito mais feliz usando a DigitalOcean pois oferece um ótimo serviço e estou livre para montar minha infra do jeito que eu quiser, e caso eu queira migrar para outro provedor - como o Linode - será muito mais tranquilo. Eu não sou contra ficar preso a alguns tipos de serviços, eu mesmo estou usando o Vimeo e alguns outros serviços como mailchimp, mas são serviços mais gerais, serviços gerenciais e é mais fácil mudar se assim eu desejar.\nO próximo passo será organizar minhas instâncias (droplets) na DigitalOcean para fazer auto scale e separar melhor as instâncias que serão responsáveis pelas app's e a instância do banco de dados, já vi alguns tutoriais e será algo divertido e que me trará um aprendizado legal.\nNum próximo post eu falo mais detalhes técnicos dessa mudança e explico como está a estrutura de minhas instâncias, de toda forma abaixo segue alguns links interessantes que eu usei, eu já tenho uma experiência legal em montar a infra básica de uma app Django mas é sempre bom ver o que a galera faz por ai, na própria \n existem muita coisa:", "category": "utils"},
{"text": "Olá pessoal, a um tempo atrás eu tinha feito um aulão no mutirão do PyCursos sobre manipulação de planilhas do excel com Python, usando as bibliotecas \n. Na época não tinha postado nada sobre isso e para ficar registrado aqui no blog e para eu me lembrar de ficar postando algo aqui, resolvi criar esse post\nAbaixo segue o vídeo do youtube com a gravação do aulão.", "category": "tutoriais"},
{"text": "Olá pessoal, recentemente eu fiz um outro aulão sobre Django Class-based Views no \n e como não tinha publicado anteriormente no blog estou colocando agora para ficar registrado.\nAbaixo segue o vídeo do youtube com a gravação do aulão.", "category": "tutoriais"}
]